Doesn't work for me.

```hcl
terraform {
  required_providers {
    proxmox = {
      # source  = "TheGameProfi/proxmox"
      # version = ">= 2.9.14"
      source  = "registry.example.com/telmate/proxmox"
      version = ">=1.0.0"
    }
  }
}

variable "proxmox_api_url" {
  type = string
}

variable "proxmox_api_token_id" {
  type      = string
  sensitive = true
}

variable "proxmox_api_token_secret" {
  type      = string
  sensitive = true
}

provider "proxmox" {
  pm_api_url          = var.proxmox_api_url
  pm_api_token_id     = var.proxmox_api_token_id
  pm_api_token_secret = var.proxmox_api_token_secret
  pm_log_enable       = true
  pm_log_file         = "terraform-plugin-proxmox.log"
  pm_debug            = true
  pm_log_levels = {
    _default    = "debug"
    _capturelog = ""
  }
}
```

```hcl
resource "proxmox_vm_qemu" "lab_servers" {
  name  = "test-vm-0.home.local"

  target_node = var.proxmox_host
  clone       = var.template_name

  agent    = 1
  os_type  = "cloud-init"
  cores    = 2
  sockets  = 1
  cpu      = "host"
  memory   = 2048
  scsihw   = "virtio-scsi-pci"
  bootdisk = "scsi0"

  disk {
    size    = "18G"
    type    = "scsi"
    storage = "vg_nvme"
    ssd     = 1
  }

  network {
    model  = "virtio"
    bridge = "vmbr0"
  }

  lifecycle {
    ignore_changes = [network]
  }
  
  ipconfig0 = "ip=dhcp"

  sshkeys = <<EOF
  ${var.ssh_key}
  EOF

}
```

```hcl
Terraform will perform the following actions:

  # proxmox_vm_qemu.lab_servers will be created
  + resource "proxmox_vm_qemu" "lab_servers" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = "scsi0"
      + clone                     = "RL92-Template"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "test-vm-0.home.local"
      + nameserver                = (known after apply)
      + onboot                    = false
      + oncreate                  = false
      + os_type                   = "cloud-init"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDJEvp+CSY962e6pqAnmANY56tiL8q7Xvy6C8sseAr1obcW4kct2/KbAi11d/Wseav+vS5B08euHl/wfg0wQE63G+BL7W1vVZhjm06cB4GFayE2UDuBiQpg16R6f+tUAHejz4J3XgWBrb3Pdxh4h/E3Zt6DLaodtUb+jZy2eUc1M7AidAUCKOGCZhdK8626E4tSnVD1ySlZSkrTXSX/p0ESn4wwZVuv6QWsOOigUuImL62evtXg+6ve9Zx8gxIOGxQn0FZAR5qsxQHnF0uumM9kdhoEHJlnORw+FNEJ8ynAKmmkWfTKooZ6HCXi0X8fFAeh5MT/TyLlSPbTNIKBMdlyLI351x5fwyMwER18hCD/ljLLUaL36FWqn282Bkt8qS8rJAdC41Q/D4E0WcO4WW7FhX5bF73hl3bL5RVKoRDfxoiMugfBdU/INKYuyMU2YGVaaLQW7VecD3kXXZcvr40DAqAZ0bPPq5y3o0efOO7R/Xbdoq17o5x+GB9kdfX5I5s=
        EOT
      + tablet                    = true
      + target_node               = "artemis"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vm_state                  = "running"
      + vmid                      = (known after apply)

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "18G"
          + slot               = (known after apply)
          + ssd                = 1
          + storage            = "vg_nvme"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

<img width="710" alt="Screenshot 2024-01-07 at 17 18 34" src="https://github.com/Telmate/terraform-provider-proxmox/assets/99525720/f7ff649c-a584-4ebe-9ac3-9d3dfe936a8c">

I can't explain but.... it worked once. Template has an 8gb disk and the plugin didn't resize it to 18.